class ExperimentModel{
  String name;
  int temp;
  int duration;
  String equipment;
  String instructions;
  ExperimentModel(this.name,this.duration,this.equipment,this.temp,this.instructions);
  static List<ExperimentModel>experimentList=[
    ExperimentModel('COD',50 ,"1.Digestor\n2.أنابيب أختبار",150,"1. نقوم باضافة 1.5 mlمن محلول Dichromateالى3.5ml من محلول sulphoric Acid and silver و2.5ml من العينه\n2.الحجم الكلى بيكون ( 7.5ml ).\n3.نحضر Blank باستخدام (2.5ml) ماء مقطر.\n4.ترج جيدا وتوضع في ال Digestor لمدة ساعتين عند درجة حرارة 150.\n5.نغلق الجهاز ثم نجمع الأنابيب خارجا لتبرد لدرجة حرارة الغرفة.\n6.كن حذرا أثناء تبريد العينة بواسطة ماء الصنبور.\n7.نقوم بالقياس عند طول موجي 620 لل high range عينة خام.\n8.نقوم بالقياس عند طول موجي 420 للlow range عينة قبل كلور."),
    ExperimentModel('TSS',120,"1.Digestor\n2.أنابيب أختبار",140, '1. نقوم باخذ بوتقه نظيفه وفارغه ونضع بها ورقة ترشيح ثم تغسل بالماء المقطر وتوضع فى فرن تجفيف لمدة 15 دقيقه  عند درجة حرارة 105 درجة مئوية \n2.بعد التجفيف توضع البوتقه فى (desi cator) لمدة ساعتين \n3.نوزع البوتقة + وربة الترشيح ويكون الوزن 1w \n4.ناخذ حجم معلوم من العينه ونقوم بترشيحه \n5.ناخذ البوتقه وورقة الترشيح بما تحتوية لنضعها فى الفرن عند درجة حرارة 105 درجة مئوية حتى تجف لمدة ساعه \n6.بعد التجفيف توضع البوتقة فى (desi cator) لمدة ساعتين ثم نقوم بوزن العينه حتى تصبح 2w '),
    ExperimentModel('PH',120,"1.Digestor\n2.أنابيب أختبار",130,'ناخذ 5 مم من العينه ونكملها الى 50 مم من الماء المقطر \n2.نضيف 2 مم من الالومنيوم موليبدات (AMM.Molybedate) + قطرتان من الاستنس كلوريد (stanuns chloride) \n3.تتكون الBlank من الماء المقطر \n4.يقاس عند طول موجى 690',),
    ExperimentModel('PO4',120 ,"1.Digestor\n2.أنابيب أختبار",150,'1.نضع 5 مم من العينه زنكملها الى 10000مم بواسطة الماء المقطر \n2.نضيف 2مم من (Color reagent)\n3.بعد 10 دقائق نقوم قياس العينه عند طول موجى =543\n 4.Blank تتكون بواسطة الماء المقطر '),
    ExperimentModel('DO',120,"1.Digestor\n2.أنابيب أختبار",140,'1.نضع 5 مم من العينه زنكملها الى 10000مم بواسطة الماء المقطر \n2.نضيف 2مم من (Color reagent)\n3.بعد 10 دقائق نقوم قياس العينه عند طول موجى =543\n 4.Blank تتكون بواسطة الماء المقطر '),
    ExperimentModel('NO2',10 ,"1.Digestor\n2.أنابيب أختبار",120,'1.نضع 5 مم من العينه زنكملها الى 10000مم بواسطة الماء المقطر \n2.نضيف 2مم من (Color reagent)\n3.بعد 10 دقائق نقوم قياس العينه عند طول موجى =543\n 4.Blank تتكون بواسطة الماء المقطر '),
    ExperimentModel('PH',120,"1.Digestor\n2.أنابيب أختبار",100,'1.نضع 0.2 ml او اربع قطرات من الزنك اسيتات (Zincahetate) و 1ml او قطرتين من هيدوركسيد الصوديوم (NaoH) مع 200 ML من العينه \n2.نرج جيدا حتى يتكون راسب ثم نقوم بترشيحه على ورقة الترشيح \n3.نجمع الراسب المترسب على وؤقة الترشيح ونذوبه فى 200 مم من الماء المقطر \n4.نضيف 10 مم من اليود (lodine) و 2مم من حمض هيدروكلوريك (HCL)\n5.نعايره مع محلول صوديوم ثيوسلفات (Na2 S2 O3) حتى تكون لون اصفر باهت \n6.نضيف قطرتين من النشاك كاشف ونكمل المعايره حتى يصبح اللون شفاف (عديم اللون )'),
    ExperimentModel('BOD',120 ,"1.Digestor\n2.أنابيب أختبار",160,'1.نضع كمية مناسبه من العينات فى الزجاجات\n2.نظع بكل زجاجه قرص معدنى \n3.وضع زجاجات BOD فى مكانها المناسب فى الجهاز مع وضع قرص من هيدروكسيد الصوديم NaoH فى غطاء فى الزجاجه\n4.نقوم بضبط درجة الحرارة ونقوم بتوصيلها بالمؤشر الزئبقى\n5.ضبط المانو ميتر على صفر بعد 30 دقيقة / 40 دقيقة '),
    ExperimentModel('NH3',120 ,"1.Digestor\n2.أنابيب أختبار",170,'1.ناخذ 5 مم من العينه ونكملها الى 100 مم بواسطة الماء المقطر \n2.نضيف 1 مم من كبريتات الزنك (Zn)+5+so4 مم (NaoH) صوديوم هيدروكسيد Rochell or EDTA\n3.يرج ثم يترك ليترسب \n 4.ناخذ 25 مم من المحلول الرائق فى الاعلى ونضيف 1 مم من (Nesslers Solution )\n5.نقوم بقياس العينه عند طول موجى =420'),
    ExperimentModel('NO3',120 ,"1.Digestor\n2.أنابيب أختبار",180,'1.ناخذ 5 مم من العينه ونكملها الى 50 مم بالماء المقطر ثم نضيف 5 جرام Sali.sod cylate صوديوم سلسيلات وتجفف فى الفرن عند درجة حرارة 105 درجة مئوية لمدة ساعتينن \n2.نقوم باضافة 2 مم من حمض الكبرتيك (H2so4) ونضيف 10مم من (k.Na.tartarate) ونكملها بالماء المقطر ل 50مم\n 3.تكون  Blank من الماء المقطر \n4.نقوم بقياس العينات عند طول موجى =420'),
  ];
}
class RecentExperiment{
  String name;
  String by;
  String time;
  String date;
  RecentExperiment( this.name, this.by, this.time, this.date );
  static Map<int,List<RecentExperiment>>recentExperimentList={
    0:[],
    1:[],
    2:[],
    3:[],
    4:[],
  };
}
class ExperimentReoprt{
  String name;
  int duration;
  int inf;
  int eff;
  ExperimentReoprt( this.name,this.duration, this.inf, this.eff );
}